Revit 2026 API

# TableData Class

---

The TableData class is implemented to hold most of the data that describe the style of the rows, columns, and cells in a table.

SystemObject Autodesk.Revit.DBTableData Autodesk.Revit.DB.ElectricalPanelScheduleData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TableData : IDisposable
```
```vb
Public Class TableData
	Implements IDisposable
```
```cpp
public ref class TableData : IDisposable
```
```fsharp
type TableData =
    class
        interface IDisposable
    end
```

The TableData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FreezeColumnsAndRows | set to true if the columns and rows should be unmovable by the slider grips |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSections | Gets the number of items in section data array. |
|  | Width | Gets or sets the table width in feet |
|  | WidthInPixels | Gets the width of the panel schedule in logical pixels |
|  | ZoomLevel | The value of zoom level for corresponding TableView. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TableData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSectionData(Int32) | Returns the section data array element at the specified index. |
|  | GetSectionData(SectionType) | Returns the pointer to the section data array element at the specified section type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Checks if this element is equal in value to the other element. |
|  | IsValidZoomLevel | Verifies if the value of zoom level is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace